#include <stdio.h>
    
int main(){
    
    float scoer = 98.5;
    printf("Score: %.1f\n", scoer);
    
    int score =90.5;
    printf("Score: %.1d\n", score);
    return 0;
}
//ทำไมต้องเลือกใช้ DATA TYPE ให้ถูกต้อง เพราะการเลือกใช้ Data Type ที่เหมาะสมจะช่วยให้โปรแกรมทํางานได้อย่างมีประสิทธิภาพและลดข้อผิดพลาดในการคำนวณและสามารถ run ได้แต่ float scoer = 98.5; จะมีการแสดงผลเป็น 98.5 แต่ int score = 98.5; จะมีการแสดงผลเป็น 90 เนื่องจาก int ไม่สามารถเก็บค่าทศนิยมได้
//การใช้ int เหมาะสมกับการเก็บค่าที่เป็นจำนวนเต็มเท่านั้น ในขณะที่ float เหมาะสมกับการเก็บค่าที่มีทศนิยม
//การใช้ float จะทำให้สามารถเก็บค่าทศนิยมได้อย่างถูกต้อง ในขณะที่การใช้ int จะทำให้ค่าทศนิยมถูกปัดเศษทิ้งไป