#include <stdio.h>
    const int GOBAL_RATE = 20;              //ประกาศนอกฟังก์ชัน เป็นตัวแปรคงที่ที่สามารถเข้าถึงได้จากทุกที่ในโปรแกรม

    void calcuate(){

const int LOCAL_BONUS =80;                // Local ประกาศภายในฟังก์ชัน เป็นตัวแปรคงที่ที่สามารถเข้าถึงได้เฉพาะภายในฟังก์ชันนี้

printf("Global rate: %d\n", GOBAL_RATE); // การเข้าถึงค่าคงที่ระดับทั่วโลก

printf("Local bonus: %d\n", LOCAL_BONUS); // การเข้าถึงค่าคงที่ภายในฟังก์ชัน

}

int main() {


calcuate(); // เรียกใช้ฟังก์ชันเพื่อตรวจสอบผลลัพธ์

printf("Global rate: %d\n", GOBAL_RATE); // การเข้าถึงค่าคงที่ระดับทั่วโลกในฟังก์ชัน main

return 0;
}

/*GOBAL คือ ตัวแปรคงที่ระดับ global ที่ประกาศนอกฟังก์ชันสามารถเข้าถึงได้จากทุกที่ในโปรแกรมLOCAL คือ ตัวแปรคงที่ระดับ local ที่ประกาศภายในฟังก์ชัน
สามารถเข้าถึงได้เฉพาะภายในฟังก์ชันนั้นเท่านั้นการใช้ const จะช่วยให้ค่าคงที่เหล่านี้ไม่สามารถเปลี่ยนแปลงได้เมื่อรันโปรแกรม จะเห็นผลลัพธ์ดังนี้
Global rate: 10 และ Local bonus: 50 ค่าของ Global rate: 
10 สามารถแสดงได้ในฟังก์ชัน main เพราะเป็นตัวแปร global
ขณะที่ Local bonus ไม่สามารถเข้าถึงจาก main ได้ เพราะเป็นตัวแปร local ภายในฟังก์ชันอื่น ถ้าเปลี่ยนค่าเป็น
GOBAL_RATE = 20;
LOCAL_BONUS = 80; โปรแกรมจะแสดงผลเป็น
Global rate: 20 และ Local bonus: 80 ซึ่งแสดงให้เห็นว่า
ตัวแปร global สามารถเข้าถึงและแสดงผลได้จากฟังก์ชัน main
ตัวแปร local จะเข้าถึงได้เฉพาะในฟังก์ชันที่ประกาศเท่านั้น
*/
