#include <stdio.h>
    
int main(){
    
    float scoer = 98.5;
    printf("Score: %.1f\n", scoer);
    
    int score =90.5;
    printf("Score: %.1d\n", score);
    return 0;
}
/*ทำไมต้องเลือกใช้ Data Type ให้ถูกต้อง?
ตอบ เพราะการเลือกใช้ Data Type ที่เหมาะสมช่วยให้โปรแกรมทำงานได้อย่างมีประสิทธิภาพ ลดข้อผิดพลาดในการคำนวณ และทำให้โปรแกรมรันได้อย่างถูกต้อง
ตัวอย่างเช่น ถ้าใช้ float score = 98.5; จะแสดงผลเป็น 98.5 เพราะ float สามารถเก็บค่าทศนิยมได้ แต่ถ้าเขียนว่า int score = 90.5; 
ค่าที่เก็บจะเป็น 90 เนื่องจาก int เป็นชนิดข้อมูลจำนวนเต็ม จึงไม่สามารถเก็บค่าทศนิยมได้ ค่าทศนิยมจะถูกตัดทิ้งไป*/ 